[
    {
        "id": "collective-seattle",
        "url": "https://www.collectiveseattle.com",
        "image": "collective.webp"
    },
    {
        "id": "svb",
        "url": "https://www.svb.com/startup-banking",
        "image": "svb.svg"
    },
    {
        "id": "aws-skills-center-seattle",
        "url": "https://aws.amazon.com/training/skills-centers/seattle-skills-center/",
        "image": "aws-skills-center-seattle.png"
    },
    {
        "id": "formidable",
        "url": "https://formidable.com",
        "image": "formidable.svg"
    },
    {
        "id": "customer-io",
        "url": "https://customer.io/",
        "image": "customer-io.svg"
    },
    {
        "id": "remix",
        "url": "https://remix.run/",
        "image": "remix.png"
    },
    {
        "id": "appwrite",
        "name": "Appwrite",
        "url": "https://appwrite.io",
        "image": "appwrite.jpg",
        "copy": "Appwrite is a secure open-source backend server provides the core APIs required to build web and mobile applications. Appwrite provides authentication, database, storage, functions, and advanced real-time capabilities."
    },
    {
        "id": "amplication",
        "name": "Amplication",
        "url": "https://amplication.com",
        "image": "amplication.png",
        "copy": "Amplication is an opensource based SaaS backend development solution that empowers professional developers to accelerate the development of Node.js applications. By using Amplication to build repetitive backend services, development teams will yield significant increases in developer productivity, reliability, and consistency of delivering critical applications to production."
    },
    {
        "id": "twilio",
        "name": "Twilio",
        "url": "https://www.twilio.com/en-us",
        "image": "twilio.png",
        "copy": "Twilio is the customer layer for the internet, powering the most engaging interactions companies build for their customers. We provide simple tools that solve hard problems, delivered as a developer-first cloud platform with global reach and no shenanigans pricing."
    },
    {
        "id": "aws",
        "name": "AWS",
        "url": "https://docs.amplify.aws/",
        "image": "aws.png",
        "copy": ""
    },
    {
        "id": "courier",
        "name": "Courier",
        "url": "https://courier.com?utm_campaign=devrel-meetups&utm_source=meetups&utm_medium=website",
        "image": "courier.png",
        "copy": ""
    },
    {
        "id": "runme.dev",
        "name": "Runme",
        "url": "https://runme.dev",
        "image": "runme.png",
        "copy": ""
    },
    {
        "id": "polaris",
        "url": "https://getpolaris.ai",
        "copy": "Polaris is an AI-powered site reliability tool that helps you detect incidents in real-time. Its tiny JavaScript SDK lets you instrument key user workflows to create indicators of reliability and latency. Apply thresholds to your indicators to define performance objectives and be alerted when your app begins to experience degradations.",
        "image": "polaris.png"
    },
    {
        "id": "seekout",
        "name": "SeekOut",
        "url": "https://www.seekout.com/",
        "copy": "Grow the talent you have.\nFind the talent you need.\nSeekOut empowers great people and companies to grow together—with actionable insights at every step of your talent journey. ",
        "image": "seekout.png"
    },
    {
        "id": "datastax",
        "name": "DataStax",
        "url": "https://www.datastax.com/",
        "copy": "DataStax is your one-stop shop for building on GenAI.",
        "image": "datastax.png"
    },
    {
        "id": "fireproof",
        "name": "Fireproof",
        "url": "https://fireproof.storage/",
        "copy": "Fireproof is an [embedded database for collaborative applications](https://use-fireproof.com/). Install it in your front-end app, or use it in any serverless cloud or edge function. Fireproof’s document API includes live updates, flexible queries, binary attachments, encrypted block replication, and multi-user sync. Fireproof enables developers to ship interactive features faster in any deployment environment.\n\nDeploy your app however you like. Install the Fireproof module into your browser or server app code and sync using remixable open-source adapters. Experience live updates across peers so everyone can collaborate together, with any backend. Render dynamic HTML and interact with APIs from the edge. Connect with the community to add support for more backends.",
        "image": "fireproof.png"
    },
    {
        "id": "sentry",
        "name": "Sentry",
        "url": "https://sentry.io/welcome/",
        "copy": "Sentry is the application monitoring platform for development teams to holistically monitor their code health from the frontend to the backend to see clearer, solve quicker, and learn continuously.",
        "image": "sentry.png"
    }
]