[
  {
    "id": "tim-obrien-january-2023",
    "speaker_id": "tim-obrien",
    "event_id": "january-2023",
    "title": "Were your skis cut with Javascript?",
    "abstract": "Just a quick snapshot of how you can use React and Express and Javascript to manufacture skis.   What are the pros and cons of using Javascript to generate CNC files and what's worked and not worked?  Looking to show a quick demo and also looking for people interested in contributing.",
    "type": "lightning"
  },
  {
    "id": "jacob-ebey-february-2023",
    "speaker_id": "jacob-ebey",
    "event_id": "february-2023",
    "title": "\"Promises\" over the wire",
    "abstract": "Learn how Remix's `defer()` feature utilizes native language features, a single HTTP request and a few react tricks to deliver, what I believe will be, the next big trend in \"full stack frameworks\".",
    "type": "regular"
  },
  {
    "id": "philip-swan-april-2023",
    "speaker_id": "philip-swan",
    "event_id": "april-2023",
    "title": "The Tethered Ring Space Infrastructure Interactive 3D Architecture Model in three.js",
    "abstract": "The Tethered Ring a game-changing architecture for making space safe, sustainable, and affordable for everyone - which clearly is not going to happen if we keep on using chemical rockets. An on-line interactive three.js-based JavaScript model captures the engineering, science, and economics behind the technology. Now anyone with internet access can review the code and contribute to the project. Come and be inspired!",
    "type": "regular"
  },
  {
    "id": "mason-lynass-march-2023",
    "speaker_id": "mason-lynass",
    "event_id": "march-2023",
    "title": "useSound - a creative, versatile tool to use audio & sound effects in React",
    "abstract": "useSound is a custom React hook developed by Josh Comeau, designed to creatively implement audio assets in React applications. I'll talk about installation and setup, differences between useSound and HTMLAudioElement, and quickly showcase a simple musical instrument built in React!",
    "type": "lightning"
  },
  {
    "id": "jamund-ferguson-june-2022",
    "speaker_id": "jamund-ferguson",
    "event_id": "june-2022",
    "title": "🧟 Web Performance Horror Stories🧛",
    "abstract": "Experience the cringe inducing horror caused by excessively slow web performance. Be shocked to hear about megabytes of CSS going unused, endlessly duplicated polyfills, input fields freezing the main thread for 50ms per keystroke and assorted other terrors. Together we'll dissect these performance poltergeists and vanquish them from our apps forever.",
    "type": "regular"
  },
  {
    "id": "brian-tran-february-2023",
    "speaker_id": "brian-tran",
    "event_id": "february-2023",
    "title": "I want my data and I want it now!",
    "abstract": "A quick talk about stream processing using NodeJS and some other use cases including displaying the data in real-time over WebSockets and React.",
    "type": "lightning"
  },
  {
    "id": "aaroh-mankad-march-2023",
    "speaker_id": "aaroh-mankad",
    "event_id": "march-2023",
    "title": "Tinkering with Framer Motion",
    "abstract": "I've been learning how to use Framer Motion recently, and wanted to walk through how it works, what you can use it for, and go through a couple of the examples from the documentation!",
    "type": "lightning"
  },
  {
    "id": "catherine-johnson-april-2023",
    "speaker_id": "catherine-johnson",
    "event_id": "april-2023",
    "title": "How to Build Accessible React Components",
    "abstract": "Hope you are strapped in for some accessibility! In this session we will breakdown how you can use built-in React tools and web accessibility guidelines to create flexible and accessible components for your website.",
    "type": "regular"
  },
  {
    "id": "michael-fitzgerald-june-2022",
    "speaker_id": "michael-fitzgerald",
    "event_id": "june-2022",
    "title": "A Quick Trip to Deno Land",
    "abstract": "A short introduction to Deno, what it is, why Ryan Dahl created it, etc. A few short small demos.",
    "type": "lightning"
  },
  {
    "id": "zach-wener-september-2021",
    "speaker_id": "zach-wener",
    "event_id": "september-2021",
    "title": "Building a UX for controllable speech",
    "abstract": "Generating perfect synthetic speech is tricky because a single sentence can be spoken in infinitely many subtly different ways. How can we give users fine-grain control over speech synthesis without adding too much UI complexity?",
    "type": "regular"
  },
  {
    "id": "rachel-lee-nabors-october-2022",
    "speaker_id": "rachel-lee-nabors",
    "event_id": "october-2022",
    "title": "The Human API",
    "abstract": "The only thing harder than writing scalable, usable code is teaching others how to wield it. As the sum of human knowledge continues to grow, so too do the challenges of teaching each other what we need to know not only to build toward the future but also to contribute to the tools of its construction. If only it were possible to transfer knowledge from one engineer directly into the minds of other engineers, like a human RAID! Rachel Lee Nabors loves building such mechanisms for knowledge transfer, from video guides to documentation to curricula. In this talk, they will discuss what doesn't work, what has worked on projects like React and React Native, and what can work for any other open source project today. Teaching is hard. But there are solid ways to approach knowledge transfer at scale.\n\nNote, this was a keynote at OpenJS World in June",
    "type": "regular"
  },
  {
    "id": "brian-gershon-november-2022",
    "speaker_id": "brian-gershon",
    "event_id": "november-2022",
    "title": "Tales of a Transition to Tailwind CSS",
    "abstract": "After some doubts, I gave Tailwind CSS a try and discovered a new love for styling my web applications. I'll discuss some reasons you'll like it, and also introduce component frameworks built on Tailwind.\n\n[Carter, if you're seeking a full talk, I could expand this from a lightning talk to a 30 minute talk by additionally walking through some code and hands-on Tailwind. Just let me know.]",
    "type": "lightning"
  },
  {
    "id": "calvin-kipperman-january-2023",
    "speaker_id": "calvin-kipperman",
    "event_id": "january-2023",
    "title": "React Is Holding Me Hostage",
    "abstract": "A love & horror story - why react isn't a good model for building interactive applications and why I'm still a react developer.",
    "type": "regular"
  },
  {
    "id": "javier-luraschi-july-2021",
    "speaker_id": "javier-luraschi",
    "event_id": "july-2021",
    "title": "Data Science with JavaScript",
    "abstract": "Javier Luraschi will present how you can perform Data Science, Machine Learning and Artificial Intelligence from #JavaScript using libraries like @d3js_org, @TensorFlow, @ml5js, tidy.js, and free tools like VSCode or hal9.ai\n\nJavier is a software engineer currently working in Hal9. Previously, in RStudio, Microsoft and SAP. He is the author of Mastering Spark with R with O'Reilly, studied Mathematics and Software Engineering in Mexico, and lives in Carnation with his wife and three kiddos.",
    "type": "regular"
  },
  {
    "id": "nate-moore-july-2021",
    "speaker_id": "nate-moore",
    "event_id": "july-2021",
    "title": "Building with Astro",
    "abstract": "Astro is a new tool for building faster websites from the team behind Snowpack. It generates highly performant Jamstack sites using the frameworks you already know and love. We'll dive into the ideas behind Astro, how it works, and how you can use Astro to supercharge your next website.",
    "type": "regular"
  },
  {
    "id": "amber-hoak-may-2022",
    "speaker_id": "amber-hoak",
    "event_id": "may-2022",
    "title": "Stumbling through ML in JavaScript: the good, the bad, and the computationally intensive",
    "abstract": "Does Tensorflow make you tense? Let’s unpack how you can get started with ML in the browser, no math required. Learn how to build models on the browser, why we would use client-side ML, and what ML tooling (and lack of tooling) is in the js ecosystem. ",
    "type": "regular"
  },
  {
    "id": "chris-griffing-march-2023",
    "speaker_id": "chris-griffing",
    "event_id": "march-2023",
    "title": "Porting Boring Avatars using Mitosis",
    "abstract": "boringavatars.com is an awesome avatars library, but its only for React. People have ported it to other frameworks but they are one-offs. I decided to use Mitosis from builder.io to make \"one repo to rule them all\". In this talk, I will go over the process and some of the issues I encountered along the way.",
    "type": "regular"
  },
  {
    "id": "matthew-t-bauer-november-2022",
    "speaker_id": "matthew-t-bauer",
    "event_id": "november-2022",
    "title": "Two left feet and an earthquake in Vue: Composition API or Options API?",
    "abstract": "Vue 3 is controversial. There were many people drawn to vue 2 and not all of them are able to find footing inside Vue 3, despite that being the main version pushed forward. With that being said Evan and the team at Vue have decided to include the options API & composition API as both valid approaches to writing vue applications, but what does that mean for the average user or the user at the end of the bell curve?",
    "type": "lightning"
  },
  {
    "id": "josh-scotland-january-2023",
    "speaker_id": "josh-scotland",
    "event_id": "january-2023",
    "title": "Supercharge Your Coding With AI: ChatGPT Demo",
    "abstract": "Learn how to use ChatGPT, a powerful AI programming tool, to enhance your coding skills and boost your productivity. In this demo, we'll explore the capabilities and limitations of ChatGPT to see firsthand how it might revolutionize your workflow.",
    "type": "lightning"
  },
  {
    "id": "lupe-canaviri-maydana-february-2023",
    "speaker_id": "lupe-canaviri-maydana",
    "event_id": "february-2023",
    "title": "Playwright, everyone can write test",
    "abstract": "In 5 mins I will show you how to create your first end to end test with Playwright",
    "type": "lightning"
  }
]
